import comp from "D:/myitem/chat_bot/qr/qrprodic/vuepress-starter/docs/.vuepress/.temp/pages/guide/update.html.vue"
const data = JSON.parse("{\"path\":\"/guide/update.html\",\"title\":\"更新日志\",\"lang\":\"zh\",\"frontmatter\":{},\"headers\":[{\"level\":2,\"title\":\"重要！！\",\"slug\":\"重要\",\"link\":\"#重要\",\"children\":[]},{\"level\":2,\"title\":\"【2022.7.8补档，将词库可以使用但是并未出现在此pro变量大全的内容进行补充，如有遗漏请联系嘎嘣[3203414635]】【二次补档更新2022.12.29】\",\"slug\":\"【2022-7-8补档-将词库可以使用但是并未出现在此pro变量大全的内容进行补充-如有遗漏请联系嘎嘣-3203414635-】【二次补档更新2022-12-29】\",\"link\":\"#【2022-7-8补档-将词库可以使用但是并未出现在此pro变量大全的内容进行补充-如有遗漏请联系嘎嘣-3203414635-】【二次补档更新2022-12-29】\",\"children\":[]},{\"level\":2,\"title\":\"<PRO变量1.1&1.1.1&1.2补充更新来自于：蓝衣〖QQ:1966735524〗>\",\"slug\":\"pro变量1-1-1-1-1-1-2补充更新来自于-蓝衣〖qq-1966735524〗\",\"link\":\"#pro变量1-1-1-1-1-1-2补充更新来自于-蓝衣〖qq-1966735524〗\",\"children\":[]},{\"level\":2,\"title\":\"<PRO变量1.1.1>\",\"slug\":\"pro变量1-1-1\",\"link\":\"#pro变量1-1-1\",\"children\":[]},{\"level\":2,\"title\":\"PRO变量2.1 本次补充更新时间:2022年1月15日\",\"slug\":\"pro变量2-1-本次补充更新时间-2022年1月15日\",\"link\":\"#pro变量2-1-本次补充更新时间-2022年1月15日\",\"children\":[]},{\"level\":2,\"title\":\"2.1.2更新 呜呜呜别骂了，群收款改了改了\",\"slug\":\"_2-1-2更新-呜呜呜别骂了-群收款改了改了\",\"link\":\"#_2-1-2更新-呜呜呜别骂了-群收款改了改了\",\"children\":[]},{\"level\":2,\"title\":\"2.1.4 修订计算部分错误描述\",\"slug\":\"_2-1-4-修订计算部分错误描述\",\"link\":\"#_2-1-4-修订计算部分错误描述\",\"children\":[]},{\"level\":2,\"title\":\"2.1.3更新 替蓝老板【蓝衣】更新总处理说明，添加“概率随机”变量及其说明\",\"slug\":\"_2-1-3更新-替蓝老板【蓝衣】更新总处理说明-添加-概率随机-变量及其说明\",\"link\":\"#_2-1-3更新-替蓝老板【蓝衣】更新总处理说明-添加-概率随机-变量及其说明\",\"children\":[]},{\"level\":2,\"title\":\"本次更新时间2022.2.5\",\"slug\":\"本次更新时间2022-2-5\",\"link\":\"#本次更新时间2022-2-5\",\"children\":[]},{\"level\":2,\"title\":\"本次更新时间2022.2.16 pro版本1.2.1\",\"slug\":\"本次更新时间2022-2-16-pro版本1-2-1\",\"link\":\"#本次更新时间2022-2-16-pro版本1-2-1\",\"children\":[]},{\"level\":2,\"title\":\"本次更新时间2022.5.28 pro版本1.2.8\",\"slug\":\"本次更新时间2022-5-28-pro版本1-2-8\",\"link\":\"#本次更新时间2022-5-28-pro版本1-2-8\",\"children\":[]},{\"level\":2,\"title\":\"本次更新时间2022.5.28 pro版本1.3.0\",\"slug\":\"本次更新时间2022-5-28-pro版本1-3-0\",\"link\":\"#本次更新时间2022-5-28-pro版本1-3-0\",\"children\":[]},{\"level\":2,\"title\":\"本次更新时间2022.6.12 pro版本1.3.1\",\"slug\":\"本次更新时间2022-6-12-pro版本1-3-1\",\"link\":\"#本次更新时间2022-6-12-pro版本1-3-1\",\"children\":[]},{\"level\":2,\"title\":\"本次更新时间2022.7.11 pro版本1.3.4\",\"slug\":\"本次更新时间2022-7-11-pro版本1-3-4\",\"link\":\"#本次更新时间2022-7-11-pro版本1-3-4\",\"children\":[]},{\"level\":2,\"title\":\"本次更新时间2022.9.9 pro版本1.3.5\",\"slug\":\"本次更新时间2022-9-9-pro版本1-3-5\",\"link\":\"#本次更新时间2022-9-9-pro版本1-3-5\",\"children\":[]},{\"level\":2,\"title\":\"本次更新时间2022.?.? pro版本???\",\"slug\":\"本次更新时间2022-pro版本\",\"link\":\"#本次更新时间2022-pro版本\",\"children\":[]}],\"git\":{},\"filePathRelative\":\"guide/update.md\"}")
export { comp, data }

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
